Ran Plan for 3 projects:

1. project: `development` dir: `development` workspace: `development`
1. project: `staging` dir: `staging` workspace: `staging`
1. project: `production` dir: `production` workspace: `production`
---

### 1. project: `development` dir: `development` workspace: `development`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ebs_volume.example will be created
+ resource "aws_ebs_volume" "example" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "CostCenter"   = "Engineering"
          + "EmailCreator" = "chuchai.k@cimbthai.com"
          + "Env"          = "CCoE"
          + "Name"         = "dev-example-ebs-volume"
          + "Owner"        = "Sre-Team"
          + "ProjectName"  = "Pool"
          + "map-migrated" = "migJL95TU4VS9"
        }
      + tags_all          = {
          + "CostCenter"   = "Engineering"
          + "EmailCreator" = "chuchai.k@cimbthai.com"
          + "Env"          = "CCoE"
          + "Name"         = "dev-example-ebs-volume"
          + "Owner"        = "Sre-Team"
          + "ProjectName"  = "Pool"
          + "map-migrated" = "migJL95TU4VS9"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ebs_volume_availability_zone = "ap-southeast-1a"
+ ebs_volume_id                = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p development
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://acb8dd746f03:4141/lock?id=chukul%252Fterraform-labs%252Fdevelopment%252Fdevelopment)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p development
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `staging` dir: `staging` workspace: `staging`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ebs_volume.example will be created
+ resource "aws_ebs_volume" "example" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "CostCenter"   = "Engineering"
          + "EmailCreator" = "chuchai.k@cimbthai.com"
          + "Env"          = "CCoE"
          + "Name"         = "sit-example-ebs-volume"
          + "Owner"        = "Sre-Team"
          + "ProjectName"  = "Pool"
          + "map-migrated" = "migJL95TU4VS9"
        }
      + tags_all          = {
          + "CostCenter"   = "Engineering"
          + "EmailCreator" = "chuchai.k@cimbthai.com"
          + "Env"          = "CCoE"
          + "Name"         = "sit-example-ebs-volume"
          + "Owner"        = "Sre-Team"
          + "ProjectName"  = "Pool"
          + "map-migrated" = "migJL95TU4VS9"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ebs_volume_availability_zone = "ap-southeast-1a"
+ ebs_volume_id                = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://acb8dd746f03:4141/lock?id=chukul%252Fterraform-labs%252Fstaging%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. project: `production` dir: `production` workspace: `production`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ebs_volume.example will be created
+ resource "aws_ebs_volume" "example" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "CostCenter"   = "Engineering"
          + "EmailCreator" = "chuchai.k@cimbthai.com"
          + "Env"          = "CCoE"
          + "Name"         = "prod-example-ebs-volume"
          + "Owner"        = "Sre-Team"
          + "ProjectName"  = "Pool"
          + "map-migrated" = "migJL95TU4VS9"
        }
      + tags_all          = {
          + "CostCenter"   = "Engineering"
          + "EmailCreator" = "chuchai.k@cimbthai.com"
          + "Env"          = "CCoE"
          + "Name"         = "prod-example-ebs-volume"
          + "Owner"        = "Sre-Team"
          + "ProjectName"  = "Pool"
          + "map-migrated" = "migJL95TU4VS9"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ebs_volume_availability_zone = "ap-southeast-1a"
+ ebs_volume_id                = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://acb8dd746f03:4141/lock?id=chukul%252Fterraform-labs%252Fproduction%252Fproduction)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```